# menu = {
#     'эсп':                {'30':  80,  '60':  100},
#     'ам':                 {'250': 100, '350': 130, '450': 160},
#     'кап':                {'250': 110, '350': 150, '450': 190},
#     'дабл':               {'250': 140, '350': 180, '450': 220},
#     'латте':              {'250': 110, '350': 150, '450': 190},
#     'раф':                {'250': 140, '350': 180, '450': 220},
#     'нутелла':            {'250': 160, '350': 210, '450': 250},
#     'сникерс':            {'250': 160, '350': 210, '450': 250},
#     'орео':               {'250': 160, '350': 210, '450': 250},
#     'халва':              {'250': 160, '350': 210, '450': 250},
#     'мокко':              {'250': 140, '350': 180, '450': 220},
#     'макиато':            {'250': 140, '350': 180, '450': 220},
#     'прянный':            {'250': 140, '350': 180, '450': 220},
#     'вафля':              {'250': 140, '350': 180, '450': 220},
#     'медовый':            {'250': 160, '350': 210, '450': 250},
#     'арахис':             {'250': 160, '350': 210, '450': 250},
#     'какао':              {'250': 120, '350': 160, '450': 190},
#     'шоколад':            {'250': 120, '350': 160, '450': 190},
#     'чай':                {'250': 80,  '350': 90,  '450': 100},
#     'лимонад':            {'350п': 170},
#     'айс':                {'350п': 220},
#     'бамбл':              {'350п': 220},
#     'айс черника':        {'350п': 260},
#     'фрапе':              {'350п': 220},
#     'коктейль':           {'350п': 160},
#
#     'сироп':              {'1': 30},
#     'сливки':             {'1': 30},
#     'марш':               {'1': 30},
#     'альт':               {'1': 60, '2': 70, '3': 80},
#
#     'Смесь':              {'кг': 1700, 'гр': 595},
#     'Эфиопия':            {'кг': 1900, 'гр': 650},
#     'Бразилия':           {'кг': 1750, 'гр': 625},
#     'Мексика':            {'гр': 650},
#     'Смесь развес':       {'гр': 1.7},
#     'Лесной орех':        {'гр': 2.3},
#     'Красный апельсин':   {'гр': 2.3},
#     'Сникерс':            {'гр': 2.7},
#     'Ирландский крем':    {'гр': 2.4},
#     'Кленовый':           {'гр': 2.3},
#     'Фисташка':           {'гр': 2.3},
#     'Гавайский орех':     {'гр': 2.3},
#     'Баунти':             {'гр': 2.7},
#     "Халва":              {'гр': 2.7},
#     'Англ.завтрак':       {'гр': 2.8},
#     'Жасмин':             {'гр': 2.65},
#     'Вишневый пунш':      {'гр': 2.65},
#     'Мол.Улун':           {'гр': 2.8},
#     'Брызги шампанского': {'гр': 2.8},
#
#     'Вода':               {'шт': 50},
#     'Кола':               {'шт': 80},
#     'Значки':             {'шт': 160},
#     'Дрип':               {'смесь': 50, 'эфиопия': 60},
#     'Шок.батончик':       {'шт': 80},
#     'Ritter Sport':       {'шт': 150},
#
#     'круасан':            {'шт': 130},
#     'чизкейк':            {'шт': 130},
#     'сендвич':            {'шт': 130},
#     'пончик':             {'шт': 100},
#     'маффин':             {'шт': 100}
#     }
# sklad = {
#     '100' :               {'мл': 0},
#     '250' :               {'мл': 0},
#     '350' :               {'мл': 0},
#     '450' :               {'мл': 0},
#     'п350':               {'мл': 0},
#
#     'Смесь':              {'кг': 0, 'гр': 0},
#     'Эфиопия':            {'кг': 0, 'гр': 0},
#     'Бразилия':           {'кг': 0, 'гр': 0},
#     'Мексика':            {'гр': 0},
#     'Смесь развес':       {'гр': 0},
#     'Лесной орех':        {'гр': 0},
#     'Красный апельсин':   {'гр': 0},
#     'Сникерс':            {'гр': 0},
#     'Ирландский крем':    {'гр': 0},
#     'Кленовый':           {'гр': 0},
#     'Фисташка':           {'гр': 0},
#     'Гавайский орех':     {'гр': 0},
#     'Баунти':             {'гр': 0},
#     "Халва":              {'гр': 0},
#     'Англ.завтрак':       {'гр': 0},
#     'Жасмин':             {'гр': 0},
#     'Вишневый пунш':      {'гр': 0},
#     'Улун':               {'гр': 0},
#     'Брызги шампанского': {'гр': 0},
#
#     'Вода':               {'шт': 0},
#     'Кола':               {'шт': 0},
#     'Значки':             {'шт': 0},
#     'Дрип':               {'смесь': 0, 'эфиопия': 0},
#     'Шок.батончик':       {'шт': 0},
#     'Ritter Sport':       {'шт': 0},
#
#     'круасан':            {'шт': 0},
#     'чизкейк':            {'шт': 0},
#     'сендвич':            {'шт': 0},
#     'пончик':             {'шт': 0},
#     'маффин':             {'шт': 0}
#     }
# clients = {
#     "89206742059": {'name': "Илья",    'phone': "89206742059", 'points': 0},
#     "89203561160": {'name': "Алексей", 'phone': "89206742058", 'points': 0},
#     "89208992509": {'name': "Максим",  'phone': "89206742058", 'points': 0}
#     }
#                    # Создаю функцию , где пользователь вводит данные по товару, с помощью цикла заказ повторяется.
#                    # Цикл постоянно просит выбрать товар до тех пор, пока пользователь не выберет "-"
#                    # После чего формируется общий заказ по позициям и общая сумма.
# def my_menu():
#     while True:
#         names = input("Выберите товар:")
#         volumes = input("Выберите ед.измерения:")
#         nums = int(input("Укажите кол-во:"))
#         for name , volume in menu.items():
#             if names == name and volumes in volume:
#                 price = menu[names][volumes]
#                 sum = price*nums
#                 orders.append((f"{names}: {volumes} - {nums}шт. -", int(sum)))
#
#                 #  - автоматическое вычетание из склада  продаваемый  товар или тару(стаканы
#
#                 if volumes == '250' or  volumes =='350' or volumes == '450'  or volumes == '450п':
#                     sklad[volumes]['мл'] -= nums
#                 elif volumes == "30" or volumes == "60":
#                     sklad['100']['мл'] -= nums
#                 else:
#                     sklad[names][volumes]-= nums
#                 # print(f"Остаток на складе: {sklad['100']['мл']} шт.")
#                 # print(f"Остаток на складе: {sklad[volumes]['мл']} мл")
#                 # print(f"Остаток на складе: {sklad[names][volumes]} кг")
#                 break
#         new_sale = input("Введите + для заказа и - для выхода:")
#         if new_sale == "-":
#             total_sum = 0
#             for name, price in orders:
#                 print(f"{name.title()} {price} руб.")
#                 total_sum += price
#             print(f"Итого: {total_sum} руб.")
#
#         bonus = input("Начислим бонусы?")
#         if bonus == "да":
#
#             points = input("выбирете операцию:")
#             numbers = input("номер телефона:")
#             find_client(clients, numbers)
#             if points == "+":
#                 add_points(clients, numbers, int(input('сумма:')) * 0.04)
#             elif points == "-":
#                 remove_points(clients, numbers, int(input("сумма для списания:")))
#         elif bonus == "+":
#             add_client(clients, input("Имя:"), input("телефон:"))
#
#         else:
#             break
#
# def add_points(clients, phone, amount): # функция начисления бонусов
#
#     clients[phone]["points"] += amount
#     print(clients[phone])
#
# def find_client(clients, phone):  # функция поиска клиентов
#     print(clients[phone])
#     return clients.get(phone)
#
# def remove_points(clients, phone, amount): #  функция списания бонусов
#     clients[phone]['points'] -= amount
#     print(clients[phone])
#
# def add_client(clients, name, phone):   # функция добавление новых клиентов
#     clients.update({phone: {"name": name, "phone": phone, "points": 0}})
#     print(clients)
#
# orders = []
# my_menu()
# #
# #                    # Создаю функцию, которая имеет следующий функционал:
# #                    # - пополнение товара
# #                    #- списание товара
# #
# #
# def my_sklad():
#     while True:
#         change = input("Введите + для пополнения и - для списания:")
#         if change == "+":
#             products = input("Выберите категорию товара для ппоплнения:")
#             volumes = input("Выберте еденицу измерения:")
#             nums = int(input("Укажите кол-во поплняемого товара:"))
#             for product , volume in sklad.items():
#                 if products == product and volumes in volume:
#                     fact = sklad[products][volumes]
#                     sklad_fact = fact + nums
#                     print(sklad_fact)
#             break
#         elif change == "-":
#             products = input("Выберите категорию товара для списания:")
#             volumes = input("Выберте еденицу измерения:")
#             nums = int(input("Укажите кол-во списываемого товара:"))
#             for product, volume in sklad.items():
#                 if products == product and volumes in volume:
#                     fact = sklad[products][volumes]
#                     sklad_fact = fact - nums
#                     print(sklad_fact)
#             break
#         else:
#             if change != "+" or "-":
#                 break
# my_sklad()




# class Product():
#     def __init__(self, menu, sklad, clients):
#         """название товара  , кол-во"""
#         self.menu = menu
#         self.sklad = sklad
#         self. clients = clients
#         self.orders = []
#         self.copy_cklad = []
#     def sale(self):
#         while True:
#             name = input("Введите назание товара:")
#             volume = input("Введите ед.измерения:")
#             num = int(input("Введите кол-во:"))
#             if name in self.menu and volume in self.menu[name]:
#                 drink = self.menu[name][volume]*num
#                 self.orders.append((f"Товар: {name.title()}({volume}) - Кол-во: {num} -", drink ))
#             else:
#                 print('Товар не найден')
#             order = input("Введите + для заказа и - для отмены:")
#             if order == "-":
#                 total = 0
#                 for name, price in self.orders:
#                     total += price
#                     print(f"{name} Цена: {price} руб.")
#                 print(f"Итого: {total} руб.")
#                 break
#
#     def my_sklad(self):
#         while True:
#             choice= input("Введите + для пополнения и - для списания:")
#             if choice == "+":
#                 name = input("Введите название позиции:")
#                 volume = input("Введите едю измерения:")
#                 num = int(input("Введите кол-во:"))
#                 if name in self.sklad and volume in self.sklad[name]:
#                     result = self.sklad[name][volume]+num
#
#
#
#
#
#
#
#
# menu = {
#     'эсп':                {'30':  80,  '60':  100},
#     'ам':                 {'250': 100, '350': 130, '450': 160},
#     'кап':                {'250': 110, '350': 150, '450': 190},
#     'дабл':               {'250': 140, '350': 180, '450': 220},
#     'латте':              {'250': 110, '350': 150, '450': 190},
#     'раф':                {'250': 140, '350': 180, '450': 220},
#     'нутелла':            {'250': 160, '350': 210, '450': 250},
#     'сникерс':            {'250': 160, '350': 210, '450': 250},
#     'орео':               {'250': 160, '350': 210, '450': 250},
#     'халва':              {'250': 160, '350': 210, '450': 250},
#     'мокко':              {'250': 140, '350': 180, '450': 220},
#     'макиато':            {'250': 140, '350': 180, '450': 220},
#     'прянный':            {'250': 140, '350': 180, '450': 220},
#     'вафля':              {'250': 140, '350': 180, '450': 220},
#     'медовый':            {'250': 160, '350': 210, '450': 250},
#     'арахис':             {'250': 160, '350': 210, '450': 250},
#     'какао':              {'250': 120, '350': 160, '450': 190},
#     'шоколад':            {'250': 120, '350': 160, '450': 190},
#     'чай':                {'250': 80,  '350': 90,  '450': 100},
#     'лимонад':            {'350п': 170},
#     'айс':                {'350п': 220},
#     'бамбл':              {'350п': 220},
#     'айс черника':        {'350п': 260},
#     'фрапе':              {'350п': 220},
#     'коктейль':           {'350п': 160},
#
#     'сироп':              {'1': 30},
#     'сливки':             {'1': 30},
#     'марш':               {'1': 30},
#     'альт':               {'1': 60, '2': 70, '3': 80},
#
#     'Смесь':              {'кг': 1700, 'гр': 595},
#     'Эфиопия':            {'кг': 1900, 'гр': 650},
#     'Бразилия':           {'кг': 1750, 'гр': 625},
#     'Мексика':            {'гр': 650},
#     'Смесь развес':       {'гр': 1.7},
#     'Лесной орех':        {'гр': 2.3},
#     'Красный апельсин':   {'гр': 2.3},
#     'Сникерс':            {'гр': 2.7},
#     'Ирландский крем':    {'гр': 2.4},
#     'Кленовый':           {'гр': 2.3},
#     'Фисташка':           {'гр': 2.3},
#     'Гавайский орех':     {'гр': 2.3},
#     'Баунти':             {'гр': 2.7},
#     "Халва":              {'гр': 2.7},
#     'Англ.завтрак':       {'гр': 2.8},
#     'Жасмин':             {'гр': 2.65},
#     'Вишневый пунш':      {'гр': 2.65},
#     'Мол.Улун':           {'гр': 2.8},
#     'Брызги шампанского': {'гр': 2.8},
#
#     'Вода':               {'шт': 50},
#     'Кола':               {'шт': 80},
#     'Значки':             {'шт': 160},
#     'Дрип':               {'смесь': 50, 'эфиопия': 60},
#     'Шок.батончик':       {'шт': 80},
#     'Ritter Sport':       {'шт': 150},
#
#     'круасан':            {'шт': 130},
#     'чизкейк':            {'шт': 130},
#     'сендвич':            {'шт': 130},
#     'пончик':             {'шт': 100},
#     'маффин':             {'шт': 100}
#     }
# sklad = {
#     '100' :               {'мл': 0},
#     '250' :               {'мл': 0},
#     '350' :               {'мл': 0},
#     '450' :               {'мл': 0},
#     'п350':               {'мл': 0},
#
#     'Смесь':              {'кг': 0, 'гр': 0},
#     'Эфиопия':            {'кг': 0, 'гр': 0},
#     'Бразилия':           {'кг': 0, 'гр': 0},
#     'Мексика':            {'гр': 0},
#     'Смесь развес':       {'гр': 0},
#     'Лесной орех':        {'гр': 0},
#     'Красный апельсин':   {'гр': 0},
#     'Сникерс':            {'гр': 0},
#     'Ирландский крем':    {'гр': 0},
#     'Кленовый':           {'гр': 0},
#     'Фисташка':           {'гр': 0},
#     'Гавайский орех':     {'гр': 0},
#     'Баунти':             {'гр': 0},
#     "Халва":              {'гр': 0},
#     'Англ.завтрак':       {'гр': 0},
#     'Жасмин':             {'гр': 0},
#     'Вишневый пунш':      {'гр': 0},
#     'Улун':               {'гр': 0},
#     'Брызги шампанского': {'гр': 0},
#
#     'Вода':               {'шт': 0},
#     'Кола':               {'шт': 0},
#     'Значки':             {'шт': 0},
#     'Дрип':               {'смесь': 0, 'эфиопия': 0},
#     'Шок.батончик':       {'шт': 0},
#     'Ritter Sport':       {'шт': 0},
#
#     'круасан':            {'шт': 0},
#     'чизкейк':            {'шт': 0},
#     'сендвич':            {'шт': 0},
#     'пончик':             {'шт': 0},
#     'маффин':             {'шт': 0}
#     }
# clients = {
#     "89206742059": {'name': "Илья",    'phone': "89206742059", 'points': 0},
#     "89203561160": {'name': "Алексей", 'phone': "89206742058", 'points': 0},
#     "89208992509": {'name': "Максим",  'phone': "89206742058", 'points': 0}
#     }
#
# shop = Product(menu, sklad, clients)
# shop.sale(

# graph = {
#     'A': {'C': 3},
#     'B': {'D': 1},
#     'C': {'A': 3, 'D': 2, 'E': 1},
#     'D': {'C': 2, 'E': 4, 'B': 1},
#     'E': {'D': 4, 'C': 1}
#     }
# distances = { vertex: float('infinity') for vertex in graph}
# print(distances)

import sys
print(sys.path)




































